src/test/resources/samples/request13.soap

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.integclaims.itf.com">
   <soapenv:Header/>
   <soapenv:Body>
      <ws:documentAttachDocument soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <username xsi:type="xsd:string">webservice</username>
         <password xsi:type="xsd:string">password</password>
         <documentId xsi:type="xsd:long">0</documentId>
         <claimId xsi:type="xsd:long">316179</claimId>
         <claimNumber xsi:type="xsd:string">16/0019013</claimNumber>
         <externalClaimReference xsi:type="xsd:string">CR4</externalClaimReference>
         <documentType xsi:type="xsd:string">DOCUMENT</documentType>
         <documentSubType xsi:type="xsd:string">STATEMENT_OF_FACT</documentSubType>
         <description xsi:type="xsd:string">vijay-test-claim-document</description>
         <relatedPartyId xsi:type="xsd:long">1571304</relatedPartyId>
         <documentFileName xsi:type="xsd:string">vijay-test-claim.tif</documentFileName>
         <attachedDocument xsi:type="xsd:base64Binary">QUJDCg==</attachedDocument>
         <senderEmailAddress xsi:type="xsd:string">integ.saradhi@integ.com</senderEmailAddress>
      </ws:documentAttachDocument>
   </soapenv:Body>
</soapenv:Envelope>